## Establish Database Connection

In [1]:
import mysql.connector

In [2]:
endpoint = "seratestdatabase.c4cjk1vto1om.us-east-2.rds.amazonaws.com"
port = "3306"
usr = "admin"
pswd = "seracapstone"
region = "us-east-2b"
dbname = "teachsim"

In [3]:
cnx = mysql.connector.connect(user=usr, password=pswd, host=endpoint, database=dbname)

In [4]:
cursor = cnx.cursor(buffered=True)

## Clear and Reset Identifiers Table for Testing

In [5]:
cursor.execute("DROP TABLE Identifiers;")

In [6]:
cursor.execute('CREATE TABLE Identifiers ( br_treat_cond int, br_treat_cond_mr int, br_treat_cond_iat int, fb_treat_cond int, f17_treat_cond int, s18_treat_cond int, fb_treat_cond_iat int, id_participant varchar(100), id_section int, id_site varchar(100), id_study int, id_year int,  PRIMARY KEY(id_participant) );')

## Upload Some Data

In [67]:
import pandas as pd
import numpy as np

In [68]:
ids = pd.read_csv("id_data.csv")

In [69]:
ids

,br_treat_cond,br_treat_cond_mr,br_treat_cond_iat,fb_treat_cond,f17_treat_cond,s18_treat_cond,fb_treat_cond_iat,id_participant,id_section,id_site,id_study,id_year
0,0,0,1,1,1,3,1,1784739,1,1,1,1718
1,1,0,1,0,3,3,1,672nhj89,3,1,3,1718
2,1,1,0,0,2,2,0,jdb3892,4,1,2,1819
3,1,0,0,1,2,1,1,8892jde33,2,1,3,1819
4,0,1,0,1,3,3,0,ehdo453,2,1,2,1920
5,0,0,1,0,1,1,0,djcsoa,3,1,4,1718
6,1,0,0,1,1,2,0,4628,4,1,5,1920
7,1,1,1,0,3,2,1,dn3ujs,1,1,6,1819

In [70]:
cursor.execute("SELECT * FROM Identifiers")
result = cursor.fetchall()
result

[]

In [71]:
cols = ",".join([str(i) for i in ids.columns.tolist()])

In [72]:
cols

'br_treat_cond,br_treat_cond_mr,br_treat_cond_iat,fb_treat_cond,f17_treat_cond,s18_treat_cond,fb_treat_cond_iat,id_participant,id_section,id_site,id_study,id_year'

In [73]:
for i,row in ids.iterrows():
    sql = "INSERT INTO Identifiers (" + cols + ") VALUES " + str(tuple(row)) + ";"
    cursor.execute(sql)
    
    #cnx.commit()

In [74]:
cursor.execute("SELECT * FROM Identifiers")
result = cursor.fetchall()
colnames = [x[0] for x in cursor.description]
pd.DataFrame(result, columns=colnames)

,br_treat_cond,br_treat_cond_mr,br_treat_cond_iat,fb_treat_cond,f17_treat_cond,s18_treat_cond,fb_treat_cond_iat,id_participant,id_section,id_site,id_study,id_year
0,0,0,1,1,1,3,1,1784739,1,1,1,1718
1,1,0,0,1,1,2,0,4628,4,1,5,1920
2,1,0,1,0,3,3,1,672nhj89,3,1,3,1718
3,1,0,0,1,2,1,1,8892jde33,2,1,3,1819
4,0,0,1,0,1,1,0,djcsoa,3,1,4,1718
5,1,1,1,0,3,2,1,dn3ujs,1,1,6,1819
6,0,1,0,1,3,3,0,ehdo453,2,1,2,1920
7,1,1,0,0,2,2,0,jdb3892,4,1,2,1819

## Close Database Connection

In [75]:
cnx.commit()
cnx.close()